Revit 2027 API
BuiltInFailures.ColorFillFailures Class
 Failures about ColorFill.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.ColorFillFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class ColorFillFailures
Public NotInheritable Class ColorFillFailures
public ref class ColorFillFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ColorFillFailures = class end
The BuiltInFailures.ColorFillFailures type exposes the following members.
Properties
Name | Description
OnlyOneColorFillNonPlan |  A Color Fill Legend can only be placed in a Floor Plan View or a Section View.
SymtemColorFillLegendNotAllowed |  [Category name] Color Fill Legend can only be placed in a Floor Plan View.
Top
See Also
Reference
Autodesk.Revit.DB Namespace